analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32690/Include/spixr_regs.h
/**@} end of group SPIXR_DATA16_Register */

/**
 * @ingroup  spixr_registers
 * @defgroup SPIXR_DATA8 SPIXR_DATA8
 * @brief    Register for reading and writing the FIFO.
 * @{
 */
#define MXC_F_SPIXR_DATA8_DATA_POS                     0 /**< DATA8_DATA Position */
#define MXC_F_SPIXR_DATA8_DATA                         ((uint8_t)(0xFFUL << MXC_F_SPIXR_DATA8_DATA_POS)) /**< DATA8_DATA Mask */

/**@} end of group SPIXR_DATA8_Register */

/**
 * @ingroup  spixr_registers
 * @defgroup SPIXR_CTRL0 SPIXR_CTRL0
 * @brief    Register for controlling SPI peripheral.
 * @{
 */
#define MXC_F_SPIXR_CTRL0_EN_POS                       0 /**< CTRL0_EN Position */
#define MXC_F_SPIXR_CTRL0_EN                           ((uint32_t)(0x1UL << MXC_F_SPIXR_CTRL0_EN_POS)) /**< CTRL0_EN Mask */

#define MXC_F_SPIXR_CTRL0_MSTR_EN_POS                  1 /**< CTRL0_MSTR_EN Position */
#define MXC_F_SPIXR_CTRL0_MSTR_EN                      ((uint32_t)(0x1UL << MXC_F_SPIXR_CTRL0_MSTR_EN_POS)) /**< CTRL0_MSTR_EN Mask */

#define MXC_F_SPIXR_CTRL0_SSIO_POS                     4 /**< CTRL0_SSIO Position */
#define MXC_F_SPIXR_CTRL0_SSIO                         ((uint32_t)(0x1UL << MXC_F_SPIXR_CTRL0_SSIO_POS)) /**< CTRL0_SSIO Mask */

#define MXC_F_SPIXR_CTRL0_TX_START_POS                 5 /**< CTRL0_TX_START Position */
#define MXC_F_SPIXR_CTRL0_TX_START                     ((uint32_t)(0x1UL << MXC_F_SPIXR_CTRL0_TX_START_POS)) /**< CTRL0_TX_START Mask */

#define MXC_F_SPIXR_CTRL0_SS_CTRL_POS                  8 /**< CTRL0_SS_CTRL Position */
#define MXC_F_SPIXR_CTRL0_SS_CTRL                      ((uint32_t)(0x1UL << MXC_F_SPIXR_CTRL0_SS_CTRL_POS)) /**< CTRL0_SS_CTRL Mask */

#define MXC_F_SPIXR_CTRL0_SS_POS                       16 /**< CTRL0_SS Position */
#define MXC_F_SPIXR_CTRL0_SS                           ((uint32_t)(0x1UL << MXC_F_SPIXR_CTRL0_SS_POS)) /**< CTRL0_SS Mask */

/**@} end of group SPIXR_CTRL0_Register */

/**
 * @ingroup  spixr_registers
 * @defgroup SPIXR_CTRL1 SPIXR_CTRL1
 * @brief    Register for controlling SPI peripheral.
 * @{
 */
#define MXC_F_SPIXR_CTRL1_TX_NUM_CHAR_POS              0 /**< CTRL1_TX_NUM_CHAR Position */
#define MXC_F_SPIXR_CTRL1_TX_NUM_CHAR                  ((uint32_t)(0xFFFFUL << MXC_F_SPIXR_CTRL1_TX_NUM_CHAR_POS)) /**< CTRL1_TX_NUM_CHAR Mask */

#define MXC_F_SPIXR_CTRL1_RX_NUM_CHAR_POS              16 /**< CTRL1_RX_NUM_CHAR Position */
#define MXC_F_SPIXR_CTRL1_RX_NUM_CHAR                  ((uint32_t)(0xFFFFUL << MXC_F_SPIXR_CTRL1_RX_NUM_CHAR_POS)) /**< CTRL1_RX_NUM_CHAR Mask */

/**@} end of group SPIXR_CTRL1_Register */

/**
 * @ingroup  spixr_registers
 * @defgroup SPIXR_CTRL2 SPIXR_CTRL2
 * @brief    Register for controlling SPI peripheral.
 * @{
 */
#define MXC_F_SPIXR_CTRL2_CPHA_POS                     0 /**< CTRL2_CPHA Position */
#define MXC_F_SPIXR_CTRL2_CPHA                         ((uint32_t)(0x1UL << MXC_F_SPIXR_CTRL2_CPHA_POS)) /**< CTRL2_CPHA Mask */

#define MXC_F_SPIXR_CTRL2_CPOL_POS                     1 /**< CTRL2_CPOL Position */
#define MXC_F_SPIXR_CTRL2_CPOL                         ((uint32_t)(0x1UL << MXC_F_SPIXR_CTRL2_CPOL_POS)) /**< CTRL2_CPOL Mask */

#define MXC_F_SPIXR_CTRL2_SCLK_FB_INV_POS              4 /**< CTRL2_SCLK_FB_INV Position */
#define MXC_F_SPIXR_CTRL2_SCLK_FB_INV                  ((uint32_t)(0x1UL << MXC_F_SPIXR_CTRL2_SCLK_FB_INV_POS)) /**< CTRL2_SCLK_FB_INV Mask */

#define MXC_F_SPIXR_CTRL2_NUMBITS_POS                  8 /**< CTRL2_NUMBITS Position */
#define MXC_F_SPIXR_CTRL2_NUMBITS                      ((uint32_t)(0xFUL << MXC_F_SPIXR_CTRL2_NUMBITS_POS)) /**< CTRL2_NUMBITS Mask */
#define MXC_V_SPIXR_CTRL2_NUMBITS_0                    ((uint32_t)0x0UL) /**< CTRL2_NUMBITS_0 Value */
#define MXC_S_SPIXR_CTRL2_NUMBITS_0                    (MXC_V_SPIXR_CTRL2_NUMBITS_0 << MXC_F_SPIXR_CTRL2_NUMBITS_POS) /**< CTRL2_NUMBITS_0 Setting */

#define MXC_F_SPIXR_CTRL2_DATA_WIDTH_POS               12 /**< CTRL2_DATA_WIDTH Position */
#define MXC_F_SPIXR_CTRL2_DATA_WIDTH                   ((uint32_t)(0x3UL << MXC_F_SPIXR_CTRL2_DATA_WIDTH_POS)) /**< CTRL2_DATA_WIDTH Mask */
#define MXC_V_SPIXR_CTRL2_DATA_WIDTH_MONO              ((uint32_t)0x0UL) /**< CTRL2_DATA_WIDTH_MONO Value */
#define MXC_S_SPIXR_CTRL2_DATA_WIDTH_MONO              (MXC_V_SPIXR_CTRL2_DATA_WIDTH_MONO << MXC_F_SPIXR_CTRL2_DATA_WIDTH_POS) /**< CTRL2_DATA_WIDTH_MONO Setting */
#define MXC_V_SPIXR_CTRL2_DATA_WIDTH_DUAL              ((uint32_t)0x1UL) /**< CTRL2_DATA_WIDTH_DUAL Value */
#define MXC_S_SPIXR_CTRL2_DATA_WIDTH_DUAL              (MXC_V_SPIXR_CTRL2_DATA_WIDTH_DUAL << MXC_F_SPIXR_CTRL2_DATA_WIDTH_POS) /**< CTRL2_DATA_WIDTH_DUAL Setting */
#define MXC_V_SPIXR_CTRL2_DATA_WIDTH_QUAD              ((uint32_t)0x2UL) /**< CTRL2_DATA_WIDTH_QUAD Value */
#define MXC_S_SPIXR_CTRL2_DATA_WIDTH_QUAD              (MXC_V_SPIXR_CTRL2_DATA_WIDTH_QUAD << MXC_F_SPIXR_CTRL2_DATA_WIDTH_POS) /**< CTRL2_DATA_WIDTH_QUAD Setting */

#define MXC_F_SPIXR_CTRL2_THREE_WIRE_POS               15 /**< CTRL2_THREE_WIRE Position */
#define MXC_F_SPIXR_CTRL2_THREE_WIRE                   ((uint32_t)(0x1UL << MXC_F_SPIXR_CTRL2_THREE_WIRE_POS)) /**< CTRL2_THREE_WIRE Mask */

#define MXC_F_SPIXR_CTRL2_SSPOL_POS                    16 /**< CTRL2_SSPOL Position */
#define MXC_F_SPIXR_CTRL2_SSPOL                        ((uint32_t)(0x1UL << MXC_F_SPIXR_CTRL2_SSPOL_POS)) /**< CTRL2_SSPOL Mask */

/**@} end of group SPIXR_CTRL2_Register */

/**
 * @ingroup  spixr_registers
 * @defgroup SPIXR_CTRL3 SPIXR_CTRL3
 * @brief    Register for controlling SPI peripheral.
 * @{
 */
#define MXC_F_SPIXR_CTRL3_SSACT1_POS                   0 /**< CTRL3_SSACT1 Position */
#define MXC_F_SPIXR_CTRL3_SSACT1                       ((uint32_t)(0xFFUL << MXC_F_SPIXR_CTRL3_SSACT1_POS)) /**< CTRL3_SSACT1 Mask */
#define MXC_V_SPIXR_CTRL3_SSACT1_256                   ((uint32_t)0x0UL) /**< CTRL3_SSACT1_256 Value */
#define MXC_S_SPIXR_CTRL3_SSACT1_256                   (MXC_V_SPIXR_CTRL3_SSACT1_256 << MXC_F_SPIXR_CTRL3_SSACT1_POS) /**< CTRL3_SSACT1_256 Setting */

