analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32690/Include/spixr_regs.h
#define MXC_F_SPIXR_CTRL3_SSACT2_POS                   8 /**< CTRL3_SSACT2 Position */
#define MXC_F_SPIXR_CTRL3_SSACT2                       ((uint32_t)(0xFFUL << MXC_F_SPIXR_CTRL3_SSACT2_POS)) /**< CTRL3_SSACT2 Mask */
#define MXC_V_SPIXR_CTRL3_SSACT2_256                   ((uint32_t)0x0UL) /**< CTRL3_SSACT2_256 Value */
#define MXC_S_SPIXR_CTRL3_SSACT2_256                   (MXC_V_SPIXR_CTRL3_SSACT2_256 << MXC_F_SPIXR_CTRL3_SSACT2_POS) /**< CTRL3_SSACT2_256 Setting */

#define MXC_F_SPIXR_CTRL3_SSIACT_POS                   16 /**< CTRL3_SSIACT Position */
#define MXC_F_SPIXR_CTRL3_SSIACT                       ((uint32_t)(0xFFUL << MXC_F_SPIXR_CTRL3_SSIACT_POS)) /**< CTRL3_SSIACT Mask */
#define MXC_V_SPIXR_CTRL3_SSIACT_256                   ((uint32_t)0x0UL) /**< CTRL3_SSIACT_256 Value */
#define MXC_S_SPIXR_CTRL3_SSIACT_256                   (MXC_V_SPIXR_CTRL3_SSIACT_256 << MXC_F_SPIXR_CTRL3_SSIACT_POS) /**< CTRL3_SSIACT_256 Setting */

/**@} end of group SPIXR_CTRL3_Register */

/**
 * @ingroup  spixr_registers
 * @defgroup SPIXR_BRGCTRL SPIXR_BRGCTRL
 * @brief    Register for controlling SPI clock rate.
 * @{
 */
#define MXC_F_SPIXR_BRGCTRL_LOW_POS                    0 /**< BRGCTRL_LOW Position */
#define MXC_F_SPIXR_BRGCTRL_LOW                        ((uint32_t)(0xFFUL << MXC_F_SPIXR_BRGCTRL_LOW_POS)) /**< BRGCTRL_LOW Mask */
#define MXC_V_SPIXR_BRGCTRL_LOW_DIS                    ((uint32_t)0x0UL) /**< BRGCTRL_LOW_DIS Value */
#define MXC_S_SPIXR_BRGCTRL_LOW_DIS                    (MXC_V_SPIXR_BRGCTRL_LOW_DIS << MXC_F_SPIXR_BRGCTRL_LOW_POS) /**< BRGCTRL_LOW_DIS Setting */

#define MXC_F_SPIXR_BRGCTRL_HIGH_POS                   8 /**< BRGCTRL_HIGH Position */
#define MXC_F_SPIXR_BRGCTRL_HIGH                       ((uint32_t)(0xFFUL << MXC_F_SPIXR_BRGCTRL_HIGH_POS)) /**< BRGCTRL_HIGH Mask */
#define MXC_V_SPIXR_BRGCTRL_HIGH_DIS                   ((uint32_t)0x0UL) /**< BRGCTRL_HIGH_DIS Value */
#define MXC_S_SPIXR_BRGCTRL_HIGH_DIS                   (MXC_V_SPIXR_BRGCTRL_HIGH_DIS << MXC_F_SPIXR_BRGCTRL_HIGH_POS) /**< BRGCTRL_HIGH_DIS Setting */

#define MXC_F_SPIXR_BRGCTRL_SCALE_POS                  16 /**< BRGCTRL_SCALE Position */
#define MXC_F_SPIXR_BRGCTRL_SCALE                      ((uint32_t)(0xFUL << MXC_F_SPIXR_BRGCTRL_SCALE_POS)) /**< BRGCTRL_SCALE Mask */

/**@} end of group SPIXR_BRGCTRL_Register */

/**
 * @ingroup  spixr_registers
 * @defgroup SPIXR_DMA SPIXR_DMA
 * @brief    Register for controlling DMA.
 * @{
 */
#define MXC_F_SPIXR_DMA_TX_FIFO_LVL_POS                0 /**< DMA_TX_FIFO_LVL Position */
#define MXC_F_SPIXR_DMA_TX_FIFO_LVL                    ((uint32_t)(0x3FUL << MXC_F_SPIXR_DMA_TX_FIFO_LVL_POS)) /**< DMA_TX_FIFO_LVL Mask */

#define MXC_F_SPIXR_DMA_TX_FIFO_EN_POS                 6 /**< DMA_TX_FIFO_EN Position */
#define MXC_F_SPIXR_DMA_TX_FIFO_EN                     ((uint32_t)(0x1UL << MXC_F_SPIXR_DMA_TX_FIFO_EN_POS)) /**< DMA_TX_FIFO_EN Mask */

#define MXC_F_SPIXR_DMA_TX_FIFO_CLEAR_POS              7 /**< DMA_TX_FIFO_CLEAR Position */
#define MXC_F_SPIXR_DMA_TX_FIFO_CLEAR                  ((uint32_t)(0x1UL << MXC_F_SPIXR_DMA_TX_FIFO_CLEAR_POS)) /**< DMA_TX_FIFO_CLEAR Mask */

#define MXC_F_SPIXR_DMA_TX_FIFO_CNT_POS                8 /**< DMA_TX_FIFO_CNT Position */
#define MXC_F_SPIXR_DMA_TX_FIFO_CNT                    ((uint32_t)(0x1FUL << MXC_F_SPIXR_DMA_TX_FIFO_CNT_POS)) /**< DMA_TX_FIFO_CNT Mask */

#define MXC_F_SPIXR_DMA_DMA_TX_EN_POS                  15 /**< DMA_DMA_TX_EN Position */
#define MXC_F_SPIXR_DMA_DMA_TX_EN                      ((uint32_t)(0x1UL << MXC_F_SPIXR_DMA_DMA_TX_EN_POS)) /**< DMA_DMA_TX_EN Mask */

#define MXC_F_SPIXR_DMA_RX_FIFO_LVL_POS                16 /**< DMA_RX_FIFO_LVL Position */
#define MXC_F_SPIXR_DMA_RX_FIFO_LVL                    ((uint32_t)(0x3FUL << MXC_F_SPIXR_DMA_RX_FIFO_LVL_POS)) /**< DMA_RX_FIFO_LVL Mask */

#define MXC_F_SPIXR_DMA_RX_FIFO_EN_POS                 22 /**< DMA_RX_FIFO_EN Position */
#define MXC_F_SPIXR_DMA_RX_FIFO_EN                     ((uint32_t)(0x1UL << MXC_F_SPIXR_DMA_RX_FIFO_EN_POS)) /**< DMA_RX_FIFO_EN Mask */

#define MXC_F_SPIXR_DMA_RX_FIFO_CLR_POS                23 /**< DMA_RX_FIFO_CLR Position */
#define MXC_F_SPIXR_DMA_RX_FIFO_CLR                    ((uint32_t)(0x1UL << MXC_F_SPIXR_DMA_RX_FIFO_CLR_POS)) /**< DMA_RX_FIFO_CLR Mask */

#define MXC_F_SPIXR_DMA_RX_FIFO_CNT_POS                24 /**< DMA_RX_FIFO_CNT Position */
#define MXC_F_SPIXR_DMA_RX_FIFO_CNT                    ((uint32_t)(0x3FUL << MXC_F_SPIXR_DMA_RX_FIFO_CNT_POS)) /**< DMA_RX_FIFO_CNT Mask */

#define MXC_F_SPIXR_DMA_DMA_RX_EN_POS                  31 /**< DMA_DMA_RX_EN Position */
#define MXC_F_SPIXR_DMA_DMA_RX_EN                      ((uint32_t)(0x1UL << MXC_F_SPIXR_DMA_DMA_RX_EN_POS)) /**< DMA_DMA_RX_EN Mask */

/**@} end of group SPIXR_DMA_Register */

/**
 * @ingroup  spixr_registers
 * @defgroup SPIXR_INTFL SPIXR_INTFL
 * @brief    Register for reading and clearing interrupt flags. All bits are write 1 to
 *           clear.
 * @{
 */
#define MXC_F_SPIXR_INTFL_TX_THRESH_POS                0 /**< INTFL_TX_THRESH Position */
#define MXC_F_SPIXR_INTFL_TX_THRESH                    ((uint32_t)(0x1UL << MXC_F_SPIXR_INTFL_TX_THRESH_POS)) /**< INTFL_TX_THRESH Mask */

#define MXC_F_SPIXR_INTFL_TX_EMPTY_POS                 1 /**< INTFL_TX_EMPTY Position */
#define MXC_F_SPIXR_INTFL_TX_EMPTY                     ((uint32_t)(0x1UL << MXC_F_SPIXR_INTFL_TX_EMPTY_POS)) /**< INTFL_TX_EMPTY Mask */

#define MXC_F_SPIXR_INTFL_RX_THRESH_POS                2 /**< INTFL_RX_THRESH Position */
#define MXC_F_SPIXR_INTFL_RX_THRESH                    ((uint32_t)(0x1UL << MXC_F_SPIXR_INTFL_RX_THRESH_POS)) /**< INTFL_RX_THRESH Mask */

#define MXC_F_SPIXR_INTFL_RX_FULL_POS                  3 /**< INTFL_RX_FULL Position */
#define MXC_F_SPIXR_INTFL_RX_FULL                      ((uint32_t)(0x1UL << MXC_F_SPIXR_INTFL_RX_FULL_POS)) /**< INTFL_RX_FULL Mask */

#define MXC_F_SPIXR_INTFL_SSA_POS                      4 /**< INTFL_SSA Position */
#define MXC_F_SPIXR_INTFL_SSA                          ((uint32_t)(0x1UL << MXC_F_SPIXR_INTFL_SSA_POS)) /**< INTFL_SSA Mask */

#define MXC_F_SPIXR_INTFL_SSD_POS                      5 /**< INTFL_SSD Position */
#define MXC_F_SPIXR_INTFL_SSD                          ((uint32_t)(0x1UL << MXC_F_SPIXR_INTFL_SSD_POS)) /**< INTFL_SSD Mask */

#define MXC_F_SPIXR_INTFL_FAULT_POS                    8 /**< INTFL_FAULT Position */
#define MXC_F_SPIXR_INTFL_FAULT                        ((uint32_t)(0x1UL << MXC_F_SPIXR_INTFL_FAULT_POS)) /**< INTFL_FAULT Mask */

