analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32690/Include/spixr_regs.h
#define MXC_F_SPIXR_INTFL_ABORT_POS                    9 /**< INTFL_ABORT Position */
#define MXC_F_SPIXR_INTFL_ABORT                        ((uint32_t)(0x1UL << MXC_F_SPIXR_INTFL_ABORT_POS)) /**< INTFL_ABORT Mask */

#define MXC_F_SPIXR_INTFL_M_DONE_POS                   11 /**< INTFL_M_DONE Position */
#define MXC_F_SPIXR_INTFL_M_DONE                       ((uint32_t)(0x1UL << MXC_F_SPIXR_INTFL_M_DONE_POS)) /**< INTFL_M_DONE Mask */

#define MXC_F_SPIXR_INTFL_TX_OVR_POS                   12 /**< INTFL_TX_OVR Position */
#define MXC_F_SPIXR_INTFL_TX_OVR                       ((uint32_t)(0x1UL << MXC_F_SPIXR_INTFL_TX_OVR_POS)) /**< INTFL_TX_OVR Mask */

#define MXC_F_SPIXR_INTFL_TX_UND_POS                   13 /**< INTFL_TX_UND Position */
#define MXC_F_SPIXR_INTFL_TX_UND                       ((uint32_t)(0x1UL << MXC_F_SPIXR_INTFL_TX_UND_POS)) /**< INTFL_TX_UND Mask */

#define MXC_F_SPIXR_INTFL_RX_OVR_POS                   14 /**< INTFL_RX_OVR Position */
#define MXC_F_SPIXR_INTFL_RX_OVR                       ((uint32_t)(0x1UL << MXC_F_SPIXR_INTFL_RX_OVR_POS)) /**< INTFL_RX_OVR Mask */

#define MXC_F_SPIXR_INTFL_RX_UND_POS                   15 /**< INTFL_RX_UND Position */
#define MXC_F_SPIXR_INTFL_RX_UND                       ((uint32_t)(0x1UL << MXC_F_SPIXR_INTFL_RX_UND_POS)) /**< INTFL_RX_UND Mask */

/**@} end of group SPIXR_INTFL_Register */

/**
 * @ingroup  spixr_registers
 * @defgroup SPIXR_INTEN SPIXR_INTEN
 * @brief    Register for enabling interrupts.
 * @{
 */
#define MXC_F_SPIXR_INTEN_TX_THRESH_POS                0 /**< INTEN_TX_THRESH Position */
#define MXC_F_SPIXR_INTEN_TX_THRESH                    ((uint32_t)(0x1UL << MXC_F_SPIXR_INTEN_TX_THRESH_POS)) /**< INTEN_TX_THRESH Mask */

#define MXC_F_SPIXR_INTEN_TX_EMPTY_POS                 1 /**< INTEN_TX_EMPTY Position */
#define MXC_F_SPIXR_INTEN_TX_EMPTY                     ((uint32_t)(0x1UL << MXC_F_SPIXR_INTEN_TX_EMPTY_POS)) /**< INTEN_TX_EMPTY Mask */

#define MXC_F_SPIXR_INTEN_RX_THRESH_POS                2 /**< INTEN_RX_THRESH Position */
#define MXC_F_SPIXR_INTEN_RX_THRESH                    ((uint32_t)(0x1UL << MXC_F_SPIXR_INTEN_RX_THRESH_POS)) /**< INTEN_RX_THRESH Mask */

#define MXC_F_SPIXR_INTEN_RX_FULL_POS                  3 /**< INTEN_RX_FULL Position */
#define MXC_F_SPIXR_INTEN_RX_FULL                      ((uint32_t)(0x1UL << MXC_F_SPIXR_INTEN_RX_FULL_POS)) /**< INTEN_RX_FULL Mask */

#define MXC_F_SPIXR_INTEN_SSA_POS                      4 /**< INTEN_SSA Position */
#define MXC_F_SPIXR_INTEN_SSA                          ((uint32_t)(0x1UL << MXC_F_SPIXR_INTEN_SSA_POS)) /**< INTEN_SSA Mask */

#define MXC_F_SPIXR_INTEN_SSD_POS                      5 /**< INTEN_SSD Position */
#define MXC_F_SPIXR_INTEN_SSD                          ((uint32_t)(0x1UL << MXC_F_SPIXR_INTEN_SSD_POS)) /**< INTEN_SSD Mask */

#define MXC_F_SPIXR_INTEN_FAULT_POS                    8 /**< INTEN_FAULT Position */
#define MXC_F_SPIXR_INTEN_FAULT                        ((uint32_t)(0x1UL << MXC_F_SPIXR_INTEN_FAULT_POS)) /**< INTEN_FAULT Mask */

#define MXC_F_SPIXR_INTEN_ABORT_POS                    9 /**< INTEN_ABORT Position */
#define MXC_F_SPIXR_INTEN_ABORT                        ((uint32_t)(0x1UL << MXC_F_SPIXR_INTEN_ABORT_POS)) /**< INTEN_ABORT Mask */

#define MXC_F_SPIXR_INTEN_M_DONE_POS                   11 /**< INTEN_M_DONE Position */
#define MXC_F_SPIXR_INTEN_M_DONE                       ((uint32_t)(0x1UL << MXC_F_SPIXR_INTEN_M_DONE_POS)) /**< INTEN_M_DONE Mask */

#define MXC_F_SPIXR_INTEN_TX_OVR_POS                   12 /**< INTEN_TX_OVR Position */
#define MXC_F_SPIXR_INTEN_TX_OVR                       ((uint32_t)(0x1UL << MXC_F_SPIXR_INTEN_TX_OVR_POS)) /**< INTEN_TX_OVR Mask */

#define MXC_F_SPIXR_INTEN_TX_UND_POS                   13 /**< INTEN_TX_UND Position */
#define MXC_F_SPIXR_INTEN_TX_UND                       ((uint32_t)(0x1UL << MXC_F_SPIXR_INTEN_TX_UND_POS)) /**< INTEN_TX_UND Mask */

#define MXC_F_SPIXR_INTEN_RX_OVR_POS                   14 /**< INTEN_RX_OVR Position */
#define MXC_F_SPIXR_INTEN_RX_OVR                       ((uint32_t)(0x1UL << MXC_F_SPIXR_INTEN_RX_OVR_POS)) /**< INTEN_RX_OVR Mask */

#define MXC_F_SPIXR_INTEN_RX_UND_POS                   15 /**< INTEN_RX_UND Position */
#define MXC_F_SPIXR_INTEN_RX_UND                       ((uint32_t)(0x1UL << MXC_F_SPIXR_INTEN_RX_UND_POS)) /**< INTEN_RX_UND Mask */

/**@} end of group SPIXR_INTEN_Register */

/**
 * @ingroup  spixr_registers
 * @defgroup SPIXR_WKFL SPIXR_WKFL
 * @brief    Register for wake up flags. All bits in this register are write 1 to clear.
 * @{
 */
#define MXC_F_SPIXR_WKFL_TX_THRESH_POS                 0 /**< WKFL_TX_THRESH Position */
#define MXC_F_SPIXR_WKFL_TX_THRESH                     ((uint32_t)(0x1UL << MXC_F_SPIXR_WKFL_TX_THRESH_POS)) /**< WKFL_TX_THRESH Mask */

#define MXC_F_SPIXR_WKFL_TX_EM_POS                     1 /**< WKFL_TX_EM Position */
#define MXC_F_SPIXR_WKFL_TX_EM                         ((uint32_t)(0x1UL << MXC_F_SPIXR_WKFL_TX_EM_POS)) /**< WKFL_TX_EM Mask */

#define MXC_F_SPIXR_WKFL_RX_THRESH_POS                 2 /**< WKFL_RX_THRESH Position */
#define MXC_F_SPIXR_WKFL_RX_THRESH                     ((uint32_t)(0x1UL << MXC_F_SPIXR_WKFL_RX_THRESH_POS)) /**< WKFL_RX_THRESH Mask */

#define MXC_F_SPIXR_WKFL_RX_FULL_POS                   3 /**< WKFL_RX_FULL Position */
#define MXC_F_SPIXR_WKFL_RX_FULL                       ((uint32_t)(0x1UL << MXC_F_SPIXR_WKFL_RX_FULL_POS)) /**< WKFL_RX_FULL Mask */

/**@} end of group SPIXR_WKFL_Register */

/**
 * @ingroup  spixr_registers
 * @defgroup SPIXR_WKEN SPIXR_WKEN
 * @brief    Register for wake up enable.
 * @{
 */
#define MXC_F_SPIXR_WKEN_TX_THRESH_POS                 0 /**< WKEN_TX_THRESH Position */
#define MXC_F_SPIXR_WKEN_TX_THRESH                     ((uint32_t)(0x1UL << MXC_F_SPIXR_WKEN_TX_THRESH_POS)) /**< WKEN_TX_THRESH Mask */

#define MXC_F_SPIXR_WKEN_TX_EM_POS                     1 /**< WKEN_TX_EM Position */
#define MXC_F_SPIXR_WKEN_TX_EM                         ((uint32_t)(0x1UL << MXC_F_SPIXR_WKEN_TX_EM_POS)) /**< WKEN_TX_EM Mask */

#define MXC_F_SPIXR_WKEN_RX_THRESH_POS                 2 /**< WKEN_RX_THRESH Position */
#define MXC_F_SPIXR_WKEN_RX_THRESH                     ((uint32_t)(0x1UL << MXC_F_SPIXR_WKEN_RX_THRESH_POS)) /**< WKEN_RX_THRESH Mask */

#define MXC_F_SPIXR_WKEN_RX_FULL_POS                   3 /**< WKEN_RX_FULL Position */
#define MXC_F_SPIXR_WKEN_RX_FULL                       ((uint32_t)(0x1UL << MXC_F_SPIXR_WKEN_RX_FULL_POS)) /**< WKEN_RX_FULL Mask */

/**@} end of group SPIXR_WKEN_Register */

/**
 * @ingroup  spixr_registers
 * @defgroup SPIXR_STAT SPIXR_STAT
 * @brief    SPI Status register.
 * @{
 */
#define MXC_F_SPIXR_STAT_BUSY_POS                      0 /**< STAT_BUSY Position */
#define MXC_F_SPIXR_STAT_BUSY                          ((uint32_t)(0x1UL << MXC_F_SPIXR_STAT_BUSY_POS)) /**< STAT_BUSY Mask */

/**@} end of group SPIXR_STAT_Register */

/**
 * @ingroup  spixr_registers
 * @defgroup SPIXR_XMEMCTRL SPIXR_XMEMCTRL
 * @brief    Register to control external memory.
 * @{
 */
#define MXC_F_SPIXR_XMEMCTRL_RD_CMD_POS                0 /**< XMEMCTRL_RD_CMD Position */
#define MXC_F_SPIXR_XMEMCTRL_RD_CMD                    ((uint32_t)(0xFFUL << MXC_F_SPIXR_XMEMCTRL_RD_CMD_POS)) /**< XMEMCTRL_RD_CMD Mask */

#define MXC_F_SPIXR_XMEMCTRL_WR_CMD_POS                8 /**< XMEMCTRL_WR_CMD Position */
#define MXC_F_SPIXR_XMEMCTRL_WR_CMD                    ((uint32_t)(0xFFUL << MXC_F_SPIXR_XMEMCTRL_WR_CMD_POS)) /**< XMEMCTRL_WR_CMD Mask */

#define MXC_F_SPIXR_XMEMCTRL_DUMMY_CLK_POS             16 /**< XMEMCTRL_DUMMY_CLK Position */
#define MXC_F_SPIXR_XMEMCTRL_DUMMY_CLK                 ((uint32_t)(0xFFUL << MXC_F_SPIXR_XMEMCTRL_DUMMY_CLK_POS)) /**< XMEMCTRL_DUMMY_CLK Mask */

#define MXC_F_SPIXR_XMEMCTRL_XMEM_EN_POS               31 /**< XMEMCTRL_XMEM_EN Position */
#define MXC_F_SPIXR_XMEMCTRL_XMEM_EN                   ((uint32_t)(0x1UL << MXC_F_SPIXR_XMEMCTRL_XMEM_EN_POS)) /**< XMEMCTRL_XMEM_EN Mask */

/**@} end of group SPIXR_XMEMCTRL_Register */

#ifdef __cplusplus
}
#endif

#endif // LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32690_INCLUDE_SPIXR_REGS_H_
